InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Renault_РаботаСПравамиПользователя/Ext/Module.bsl
Функция ЕстьПравоИспользоватьАрмРесепшена(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАрмРесепшена, ЛОЖЬ) КАК РазрешитьРаботуСАрмРесепшена
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.РазрешитьРаботуСАрмРесепшена Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция НапоминаниеПоОТСПроданныеАвто(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.УведомлениеОбОТСПроданные, ЛОЖЬ) КАК УведомлениеОбОТСПроданные
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.УведомлениеОбОТСПроданные Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция НапоминаниеПоОТСНЕПроданныеАвто(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.УведомлениеОбОТСНЕПроданные, ЛОЖЬ) КАК УведомлениеОбОТСНЕПроданные
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.УведомлениеОбОТСНЕПроданные Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция МаксимальноеКоличествоДнейРезерва(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.МаксимальноеКоличествоДнейРезерва), 0) КАК ПраваИНастройкиМаксимальноеКоличествоДнейРезерва
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = 0;
	Для Каждого Шаблон Из Шаблоны Цикл
		ЕстьПраво = Шаблон.ПраваИНастройкиМаксимальноеКоличествоДнейРезерва;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоИспользоватьАрмМенеджера(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАрмМенеджера, ЛОЖЬ) КАК РазрешитьРаботуСАрмМенеджера
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.РазрешитьРаботуСАрмМенеджера Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоИспользоватьАрмАвтосклад(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАрмАвтосклад, ЛОЖЬ) КАК РазрешитьРаботуСАрмАвтосклад
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.РазрешитьРаботуСАрмАвтосклад Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоАдминистрированияАрмАвтосклад(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваАдминистратораАРМАвтосклад, ЛОЖЬ) КАК ПраваАдминистратораАРМАвтосклад
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ПраваАдминистратораАРМАвтосклад Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоКорпПродажи(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Зап.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАРМКорпоративныхПродаж, ЛОЖЬ) КАК РазрешитьРаботуСАРМКорпоративныхПродаж,
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРасботуСАРМРуководителяКП, ЛОЖЬ) КАК РазрешитьРасботуСАРМРуководителяКП
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Иначе
		Зап.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАРМКорпоративныхПродаж, ЛОЖЬ) КАК РазрешитьРаботуСАРМКорпоративныхПродаж,
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРасботуСАРМРуководителяКП, ЛОЖЬ) КАК РазрешитьРасботуСАРМРуководителяКП
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = &Пользователь";
	КонецЕсли;
	
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выбрать();
	ЕстьПраво = Ложь;
	Пока Шаблоны.Следующий() Цикл
		Если Шаблоны.РазрешитьРаботуСАРМКорпоративныхПродаж Или Шаблоны.РазрешитьРасботуСАРМРуководителяКП Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоПросмотраЦенЗакупки(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПравоПросмотраЦенЗакупки, ЛОЖЬ) КАК ПравоПросмотраЦенЗакупки 
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ПравоПросмотраЦенЗакупки Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоУправленияВыкупом(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Автосклад_ВыкупАвто, ЛОЖЬ) КАК Автосклад_ВыкупАвто
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.Автосклад_ВыкупАвто Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ОтделПоУмолчанию(Пользователь) Экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	Ответ  = Справочники.CRM_Отделы.ПустаяСсылка();
	Для Каждого Шаблон Из Шаблоны Цикл
		Ответ = Шаблон.ПраваИНастройкиОтдел;
	КонецЦикла;
	Возврат Ответ;
	
КонецФункции

Функция ДилерскийЦентрПоУмолчанию(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр КАК ДилерскийЦентр
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.ДилерскийЦентр;
	КонецЦикла;
	
	Возврат Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьСписокЗонВыдачиПоУмолчанию(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ДилерскиеЦентрыЗоныВыдачи.ЗонаВыдачи
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.ЗоныВыдачи КАК CRM_ДилерскиеЦентрыЗоныВыдачи
	|		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр = CRM_ДилерскиеЦентрыЗоныВыдачи.Ссылка
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	СписокПлощадок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗонаВыдачи");
	Возврат СписокПлощадок;
	
КонецФункции

Функция ЕстьПравоИспользоватьАрмРОП(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАрмРОП, ЛОЖЬ) КАК РазрешитьРаботуСАрмРОП
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.РазрешитьРаботуСАрмРОП Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоАдминистратораАвтосклада(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваАдминистратораАРМАвтосклад) КАК ПраваАдминистратораАРМАвтосклад
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПраваАдминистратораАРМАвтосклад = Ложь;
	Если Выборка.Следующий() Тогда
		ПраваАдминистратораАРМАвтосклад = Выборка.ПраваАдминистратораАРМАвтосклад; 
	КонецЕсли;
	
	Возврат ПраваАдминистратораАРМАвтосклад;
	
КонецФункции // ЕстьПравоАдминистратораАвтосклада()

Функция ЕстьПравоИспользоватьПанельСообщений(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСПанельюСообщений, ЛОЖЬ) КАК РазрешитьРаботуСПанельюСообщений
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.РазрешитьРаботуСПанельюСообщений Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЗапускатьПриСтартеПанельСообщений(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапкускатьПриСтартеПанельСообщений, ЛОЖЬ) КАК ЗапкускатьПриСтартеПанельСообщений
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ЗапкускатьПриСтартеПанельСообщений Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ЗапускатьПриСтартеПанельИнформацииПланаПродажСотрудника(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Сервис_ОткрыватьПанельИнформацииПоПлануПродажСотрудника, ЛОЖЬ) КАК ЗапускатьПриСтарте
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Результат = Запрос.Выполнить();
	
	ЗапускатьПриСтарте = Ложь;
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗапускатьПриСтарте = Выборка.ЗапускатьПриСтарте;
	КонецЕсли;
	
	Возврат ЗапускатьПриСтарте;
	
КонецФункции

Функция ЗапускатьПриСтартеПанельТелефонии(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапускатьПриСтартеПанельТелефонии, ЛОЖЬ) КАК ЗапускатьПриСтартеПанельТелефонии
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ЗапускатьПриСтартеПанельТелефонии Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ЗапускатьПриСтартеАрмРесепшен(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапускатьПриСтартеАрмАдминистратора, ЛОЖЬ) КАК ЗапускатьПриСтартеАрмАдминистратора
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ЗапускатьПриСтартеАрмАдминистратора Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ЗапускатьПриСтартеАрмАвтосклад(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапускатьПриСтартеАрмАвтосклад, ЛОЖЬ) КАК ЗапускатьПриСтартеАрмАвтосклад
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ЗапускатьПриСтартеАрмАвтосклад Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ЗапускатьПриСтартеАрмМенеджера(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапускатьПриСтартеАрмМенеджера, ЛОЖЬ) КАК ЗапускатьПриСтартеАрмМенеджера
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ЗапускатьПриСтартеАрмМенеджера Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ЗапускатьПриСтартеАрмРОП(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапускатьПриСтартеАрмРОП, ЛОЖЬ) КАК ЗапускатьПриСтартеАрмРОП
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ЗапускатьПриСтартеАрмРОП Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ЕстьПравоНаПодтверждениеДокументаТестДрайв(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПравоНаПодтверждениеДокументаТестДрайв, ЛОЖЬ) КАК ПравоНаПодтверждениеДокументаТестДрайв
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ПравоНаПодтверждениеДокументаТестДрайв Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ПолучитьПравоРено(Пользователь, Право) Экспорт
	
	Итог = Ложь;
	Если Право = "РазрешитьРаботуСАРМРесепшн" Тогда
		Итог = ЕстьПравоИспользоватьАрмРесепшена(Пользователь);
	ИначеЕсли Право = "РазрешитьРаботуСАРММенеджера" Тогда
		Итог = ЕстьПравоИспользоватьАрмМенеджера(Пользователь);
	ИначеЕсли Право = "РазрешитьРаботуСАРМРуководителя" Тогда
		Итог = ЕстьПравоИспользоватьАрмРОП(Пользователь);
	ИначеЕсли Право = "ПравоНаПодтверждениеДокументаТестДрайв" Тогда
		Итог = ЕстьПравоНаПодтверждениеДокументаТестДрайв(Пользователь);
	ИначеЕсли Право = "ОтделПоУмолчанию" Тогда
		Итог = ОтделПоУмолчанию(Пользователь);
	ИначеЕсли Право = "ДилерскийЦентрПоУмолчанию" Тогда
		Итог = ДилерскийЦентрПоУмолчанию(Пользователь);
	ИначеЕсли Право = "ЗапускатьПриСтартеАРМРесепшн" Тогда
		Итог = ЗапускатьПриСтартеАрмРесепшен(Пользователь);
	ИначеЕсли Право = "ЗапускатьПриСтартеАРММенеджера" Тогда
		Итог = ЗапускатьПриСтартеАрмМенеджера(Пользователь);
	ИначеЕсли Право = "ЗапускатьПриСтартеАРМРуководителя" Тогда
		Итог = ЗапускатьПриСтартеАрмРОП(Пользователь);
	ИначеЕсли Право = "РазрешитьРаботуСПанельюСообщений" Тогда
		Итог = ЕстьПравоИспользоватьПанельСообщений(Пользователь);
	ИначеЕсли Право = "ЗапускатьПриСтартеПанельСообщений" Тогда
		Итог = ЗапускатьПриСтартеПанельСообщений(Пользователь);
	Иначе
		Итог = Ложь;
	КонецЕсли;
	Возврат Итог;
	
КонецФункции

Функция ПолучитьСтруктуруНастроекАвтосклад(Пользователь=Неопределено) Экспорт
	Ответ=Новый Структура;
	Ответ.Вставить("ИспользоватьОтборПоДилерскимЦентрам", Ложь);
	Ответ.Вставить("ИспользоватьОтборПоСчетам", Ложь);
	Ответ.Вставить("ИспользоватьОтборПоСкладам", Ложь);
	Ответ.Вставить("ИспользоватьОтборПоАдресамОтгрузкиАвтоВПроизводстве", Ложь);
	Ответ.Вставить("ДоступныеДилерскиеЦентры", Неопределено);
	Ответ.Вставить("ДоступныеСчета", Неопределено);
	Ответ.Вставить("ДоступныеСклады", Неопределено);
	Ответ.Вставить("ДоступныеАдресаОтгрузки", Неопределено);
	Ответ.Вставить("ТипЦен", Справочники.ТипыЦен.ПустаяСсылка());
	Если Пользователь=Неопределено Тогда Возврат Ответ КонецЕсли;
	
	Запрос=Новый Запрос("Выбрать ПраваИНастройки Из РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек ГДЕ Пользователь=&Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ.Вставить("ИспользоватьОтборПоДилерскимЦентрам", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоДилерскимЦентрам);
		Ответ.Вставить("ИспользоватьОтборПоАдресамОтгрузкиАвтоВПроизводстве", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоАдресамОтгрузкиАвтоВПроизводстве); //DMSCOR-1475
		Ответ.Вставить("ИспользоватьОтборПоСчетам", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоСчетам);
		Ответ.Вставить("ИспользоватьОтборПоСкладам", Выборка.ПраваИНастройки.Автосклад_ИспользоватьОтборПоСкладам);
		Ответ.Вставить("ДоступныеДилерскиеЦентры", Выборка.ПраваИНастройки.Автосклад_ДоступныеДилерскиеЦентры.ВыгрузитьКолонку("ДилерскийЦентр"));
		Ответ.Вставить("ДоступныеСчета", Выборка.ПраваИНастройки.Автосклад_ДоступныеСчета.ВыгрузитьКолонку("Счет"));
		Ответ.Вставить("ДоступныеСклады", Выборка.ПраваИНастройки.Автосклад_ДоступныеСклады.ВыгрузитьКолонку("Склад"));
		Ответ.Вставить("ТипЦен", Выборка.ПраваИНастройки.ДилерскийЦентр.ТипЦенПродажи);
		Ответ.Вставить("ДоступныеАдресаОтгрузки", Выборка.ПраваИНастройки.Автосклад_ДоступныеАдресаОтгрузок.ВыгрузитьКолонку("АдресОтгрузки"));
	КонецЕсли;	
	Возврат Ответ	
КонецФункции

Функция ПолучитьТипЦенКП(ДилерскийЦентр = неопределено) Экспорт
	
	Если Не (ДилерскийЦентр = неопределено) Тогда
		Если (ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка()) Тогда
			Возврат Константы.CRM_ТипЦенКП.Получить();
		Иначе
			Если ДилерскийЦентр.ТипЦенКП = Справочники.ТипыЦен.ПустаяСсылка() Тогда
				Возврат Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
			Иначе
				Возврат ДилерскийЦентр.ТипЦенКП;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Возврат Константы.CRM_ТипЦенКП.Получить();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМоиНастройки(Пользователь) Экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки КАК Ссылка
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь
	|	И Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПометкаУдаления = ЛОЖЬ");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	Возврат Шаблоны;
	
КонецФункции    

Функция ПолучитьНастройкуРедактированияНомераДоговораКП(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПравоНаРедактированияНомераДоговораКП, ЛОЖЬ) КАК ПравоНаРедактированияНомераДоговораКП
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ПравоНаРедактированияНомераДоговораКП Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;

КонецФункции

Функция ИнтервалОбновленияПанелиСообщений(Пользователь) Экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ВремяОбнавленияПанелиСообщения
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	Ответ = Справочники.CRM_Отделы.ПустаяСсылка();
	Для Каждого Шаблон Из Шаблоны Цикл
		Ответ = Шаблон.ПраваИНастройкиВремяОбнавленияПанелиСообщения;
	КонецЦикла;
	Если Ответ <= 0 Тогда
		Ответ = 15;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции


Функция ПолучитьЕмаилПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактнаяИнформация.Представление
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Вид = &Вид
	                      |	И КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	Запрос.УстановитьПараметр("Объект", Пользователь.Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактнаяИнформация.Представление
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Вид = &Вид
	                      |	И КонтактнаяИнформация.Объект = &Объект");	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Запрос.УстановитьПараметр("Объект", Пользователь.Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


Процедура УстановитьЕмаилПользователя(Пользователь, Емаил) Экспорт
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Менеджер.Объект = Пользователь.Сотрудник;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
	Менеджер.Представление = Емаил;
	Менеджер.Записать();
	
КонецПроцедуры

Процедура УстоновитьТелефонПользователя(Пользователь,Телефон) Экспорт
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Тип =  Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Объект = Пользователь.Сотрудник;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
	Менеджер.Представление = Телефон;
	Менеджер.Записать();
	
КонецПроцедуры

Функция ЕстьПравоИспользоватьАрмКонтактЦентр(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьРаботуСАрмКонтактЦентра, ЛОЖЬ) КАК РазрешитьРаботуСАрмКонтактЦентра
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.РазрешитьРаботуСАрмКонтактЦентра Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоИспользоватьАрмКонтактЦентрМенеджер(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваКЦМенеджер, ЛОЖЬ) КАК ПраваКЦМенеджер
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ПраваКЦМенеджер Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоИспользоватьАрмКонтактЦентрАдминистратор(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ПраваКЦАдминистратор, ЛОЖЬ) КАК ПраваКЦАдминистратор
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ПраваКЦАдминистратор Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоИзменятьПравилаУчастияВПрограммеЛояльности(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьИзменятьПравилаУчастия, ЛОЖЬ) КАК РазрешитьИзменятьПравилаУчастия
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.РазрешитьИзменятьПравилаУчастия Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоВыдаватьКартуВручную(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьВыдачуКартыВручную, ЛОЖЬ) КАК РазрешитьВыдачуКартыВручную
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.РазрешитьВыдачуКартыВручную Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоИзменятьПрограммуЛояльности(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьИзменениеПрограммыЛояльности, ЛОЖЬ) КАК РазрешитьИзменениеПрограммыЛояльности
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.РазрешитьИзменениеПрограммыЛояльности Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЗапускатьПриСтартеАрмКонтактЦентр(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапускатьПриСтартеАрмКонтактЦентра, ЛОЖЬ) КАК ЗапускатьПриСтартеАрмКонтактЦентра
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	АвтоматическиЗапускать = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ЗапускатьПриСтартеАрмКонтактЦентра Тогда
			АвтоматическиЗапускать = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат АвтоматическиЗапускать;
	
КонецФункции

Функция ПолучитьТаблицуСсылокНаСотрудниковПоОтделу(Отдел) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник КАК Ссылка
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел = &Отдел
	                      |	И НЕ Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	                      |	И НЕ Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник ЕСТЬ NULL 
	                      |	И Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник.ФлагУволен = ЛОЖЬ");
	Запрос.УстановитьПараметр("Отдел", Отдел);
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьСписокПрав(Пользователь) Экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	*
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПраваИНастройкиПользователей КАК Renault_ПраваИНастройкиПользователей
	                   |		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = Renault_ПраваИНастройкиПользователей.Ссылка
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	
	Ответ = Новый Структура();
	Для Каждого Колонка Из Шаблоны.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если Колонка.ТипЗначения.СодержитТип(Тип("ТаблицаЗначений")) Тогда
			//Таблицу значений хранить в параметрах сеанса нельзя
			//Если ИмяКолонки = "Автосклад_ДоступныеДилерскиеЦентры" Тогда				
			//	Ответ.Вставить(ИмяКолонки, Шаблоны[0][ИмяКолонки].ВыгрузитьКолонку("ДилерскийЦентр"));
			//ИначеЕсли ИмяКолонки = "Автосклад_ДоступныеСчета" Тогда				
			//	Ответ.Вставить(ИмяКолонки, Шаблоны[0][ИмяКолонки].ВыгрузитьКолонку("Счет"));
			//ИначеЕсли ИмяКолонки = "Автосклад_ДоступныеСклады" Тогда				
			//	Ответ.Вставить(ИмяКолонки, Шаблоны[0][ИмяКолонки].ВыгрузитьКолонку("Склад"));
			//КонецЕсли;
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
			МассивЗнач = Шаблоны.ВыгрузитьКолонку(ИмяКолонки);                           
			Если МассивЗнач.Найти(Истина) = Неопределено Тогда
				Ответ.Вставить(ИмяКолонки, Ложь);
			Иначе
				Ответ.Вставить(ИмяКолонки, Истина);
			КонецЕсли;
		Иначе
			Если Шаблоны.Количество() > 0 Тогда
				Ответ.Вставить(ИмяКолонки, Шаблоны[0][ИмяКолонки]);
			Иначе
				Ответ.Вставить(ИмяКолонки, Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Релиз = Метаданные.Версия;
	Поиск = Найти(Релиз, ".");
	Версия = "";
	Если Поиск > 1 Тогда
		Версия = Лев(Релиз, Поиск -1);
	КонецЕсли;
	Ответ.Вставить("ВерсияАльфаАвто", Версия);
	Ответ.Вставить("РелизАльфаАвто", Релиз);
	
	Возврат Новый ФиксированнаяСтруктура(Ответ);
	
КонецФункции

Функция ПолучитьШаблоныПравПользователя(Пользователь) Экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Ссылка КАК Ссылка
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	Возврат Шаблоны;
	
КонецФункции

Функция ЕстьПравоНаЦентрализованныеАкции(Пользователь) экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Сервис_ПравоНаЦентрализованныеАкции, ЛОЖЬ) КАК Сервис_ПравоНаЦентрализованныеАкции
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.Сервис_ПравоНаЦентрализованныеАкции = Истина Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоНаРедактированиеПланировщика(Пользователь) экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Сервис_ТолькоПросмотрПланировщика, ЛОЖЬ) КАК Сервис_ТолькоПросмотрПланировщика
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Истина;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.Сервис_ТолькоПросмотрПланировщика = Истина Тогда
			ЕстьПраво = Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоНаОткрытиеАРМАвтосервис(Пользователь) экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Сервис_ПравоОткрыватьАрмАвтосервиса, ЛОЖЬ)
	                      |		и НЕ ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДоступКПодразделуАвтосервисЗапрещен, ИСТИНА) КАК Сервис_ПравоОткрыватьАрмАвтосервиса
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.Сервис_ПравоОткрыватьАрмАвтосервиса = Истина Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоОткрытияПодсистемыАвтосервиса(Пользователь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	не ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДоступКПодразделуАвтосервисЗапрещен, Истина) КАК Сервис_ПравоОткрыватьАрмАвтосервиса
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		ЕстьПраво = Шаблон.Сервис_ПравоОткрыватьАрмАвтосервиса;
	КонецЦикла;
	Возврат ЕстьПраво;
КонецФункции

Функция ЕстьПравоОткрытияОтчетапродаж(Пользователь,ИмяОтчета) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НЕ ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки."+ИмяОтчета+", Истина) КАК Сервис_ПравоОткрыватьОтчет
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		ЕстьПраво = Шаблон.Сервис_ПравоОткрыватьОтчет;
	КонецЦикла;
	Возврат ЕстьПраво;
КонецФункции

Функция ЕстьПравоОткрытияПодсистемыСтрахования(Пользователь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	не ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДоступКПодразделуСтрахованияЗапрещен, Истина) КАК ДоступКПодразделуСтрахованияЗапрещен
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		ЕстьПраво = Шаблон.ДоступКПодразделуСтрахованияЗапрещен;
	КонецЦикла;
	Возврат ЕстьПраво;
КонецФункции

Функция ЕстьПравоНаЭтапВыдачи(Пользователь, ЭтапВыдачи) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ПраваИНастройкиПользователейПродажи_ЭтапыВыдачи.Ссылка
	                      |ИЗ
	                      |	Справочник.Renault_ПраваИНастройкиПользователей.Продажи_ЭтапыВыдачи КАК Renault_ПраваИНастройкиПользователейПродажи_ЭтапыВыдачи
	                      |ГДЕ
	                      |	Renault_ПраваИНастройкиПользователейПродажи_ЭтапыВыдачи.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Ссылка
	                      |			ИЗ
	                      |				РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |			ГДЕ
	                      |				Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь)
	                      |	И Renault_ПраваИНастройкиПользователейПродажи_ЭтапыВыдачи.Этап = &Этап");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Этап", ЭтапВыдачи);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЕстьПравоНаОткрытиеАРМГарантия(Пользователь) экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Гарантия_ПравоНаОткрытиеАРМ, ЛОЖЬ) КАК Гарантия_ПравоНаОткрытиеАРМ
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.Гарантия_ПравоНаОткрытиеАРМ = Истина Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоНаРаботуСФункционаломПриемаАвто(Пользователь) экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Продажи_РазрешитьВРЛРасширенногоФункционалаТрейдИн, ЛОЖЬ) КАК ПравоПриемАвто
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ПравоПриемАвто = Истина Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоНаУстановкуЦенДопОборудования(Пользователь) экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.РазрешитьУстанавливатьЦеныДопОборудования, ЛОЖЬ) КАК РазрешитьУстанавливатьЦеныДопОборудования
	                      |ИЗ
	                      |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |ГДЕ
	                      |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	ЕстьПраво = Ложь;
	
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.РазрешитьУстанавливатьЦеныДопОборудования = Истина Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоНаРаботуСоСлужебнымиФункциямиRenault() Экспорт
	РольДоступна = РольДоступна("Renault_АдминистративныйИнтерфейсRenault");
	
	#Если Клиент Тогда
	Если НЕ РольДоступна Тогда
		Предупреждение("Нет прав на данное действие!");	
	КонецЕсли;
	#КонецЕсли
	
	Возврат РольДоступна;	
КонецФункции

Функция ЗапрашиватьПодтверждениеИзмененийВКП(Пользователь) экспорт
	
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗапрашиватьПодтверждениеИзмененийВКП, ЛОЖЬ) КАК ЗапрашиватьПодтверждениеИзмененийВКП
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЗапрашиватьПодтверждениеИзмененийВКП = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если Шаблон.ЗапрашиватьПодтверждениеИзмененийВКП Тогда
			ЗапрашиватьПодтверждениеИзмененийВКП = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЗапрашиватьПодтверждениеИзмененийВКП;
	
КонецФункции

Функция ПолучитьРольПользователя_КонтактЦентр(Пользователь) экспорт
	
	Ответ = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.КонтактЦентр_РольПользователя КАК Роль
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Роль;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЕстьПравоСоздаватьПростойНаГрафикеСервиса(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Сервис_АрмАвтосервис_ЗапретНаСозданиеПростоевНаГрафике, ЛОЖЬ) КАК Сервис_АрмАвтосервис_ЗапретНаСозданиеПростоевНаГрафике
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Истина;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.Сервис_АрмАвтосервис_ЗапретНаСозданиеПростоевНаГрафике Тогда
			ЕстьПраво = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоУдалятьПростойНаГрафикеСервиса(Пользователь) экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Сервис_АрмАвтосервис_ЗапретНаУдалениеПростоевНаГрафике, ЛОЖЬ) КАК Сервис_АрмАвтосервис_ЗапретНаУдалениеПростоевНаГрафике
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	Зап.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Зап.Выполнить().Выгрузить();
	ЕстьПраво = Истина;
	Для Каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.Сервис_АрмАвтосервис_ЗапретНаУдалениеПростоевНаГрафике Тогда
			ЕстьПраво = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	Возврат ЕстьПраво;
	
КонецФункции
